#ifndef	__KEYFUN_H__
#define	__XXXXX_H__



//#define KEY_SIZE 20

/**********************************************************
//外部变量声明
**********************************************************/

	
//extern u8  showStandby;//显示日期
//extern u32 Standbycount;//不显示日期时计时计数

//extern u8 showtime;//显示时间
//extern u32 timecount;//不显示时间时计时计数

//extern u32 keyidx;//字符接收个数
//extern u8 keybuff[];//接收的字符



//extern u32 key;      //按键值



/**********************************************************
//外部函数声明
**********************************************************/






#endif
