#ifndef	__VOLUME_H__
#define	__VOLUME_H__

#include "sys.h"

//extern


/**********************************************************
//外部变量声明
**********************************************************/

	

#define CD4051_A PDout(13)// PD13
#define CD4051_B PDout(14)// PD14	
#define CD4051_C PDout(15)// PD15	




/**********************************************************
//外部函数声明
**********************************************************/


void InitVolume(void);


void SET_Volume(uint8_t *Val);

#endif
