#ifndef	__AT24C256_H__
#define	__AT24C256_H__


/**********************************************************
//外部变量声明
**********************************************************/
#define	CARD_SIZE			  4 //卡号长度
#define	NAME_SIZE			  4

#define AT_PAGE_SIZE	  128L  //页大小(字节)
#define AT_PAGE_SUM		  512L //页总数
#define GROUP_NUM		    35L  //分组数，同步清除所有卡！
#define GROUP_PAGE		  12L  //每组占用页数

#define	AT_SUM_SIZE			(AT_PAGE_SIZE * AT_PAGE_SUM)  //总储存空间大小 128*512=65536 字节

#define	GROUP_SPACE			(GROUP_PAGE * AT_PAGE_SIZE)   //组空间  12*128=1536

#define	GROUP_RECORD		(GROUP_SPACE / (NAME_SIZE+2)) //组名单数  1536/6=256


/**********************************************************
//1、分组名单数量 （白名单）                         第0页
**********************************************************/
#define	NUM_START			      10L                         //白名单数量 35*2=70字节
#define COMM_POS	          (NUM_START+70L)           //白名单公共区数量 2字节


/**********************************************************
//2、白名单存储(8960个名单)                        第1页 --421页
**********************************************************************/
#define	GROUP_ST			    (AT_PAGE_SIZE  )//起始地址

#define	GROUP_END_ST			(GROUP_ST + GROUP_SPACE*GROUP_NUM) //结束地址 = 名单起始地址+组空间（1536字节）*组数（35组）=  128  + 53760=53888

/**********************************************************
//3、公共组 （512条名单）                    第422页--446页
**********************************************************/
#define	COMM_ST				  GROUP_END_ST      //公共区名单存储起始位置 分组结束地址+128  53888+128=54016  

#define	COMM_END_ST 	 (COMM_ST+ GROUP_PAGE * AT_PAGE_SIZE*2)  //公共区结束位置(公共区起始地址+公共区名单总地址数量)          //54016+128*12*2=53889+3072=57088 

#define	COMM_SIZE			 ((COMM_END_ST - COMM_ST) / (NAME_SIZE+2)) //公共区名单数(公共区结束地址-白名单结束地址) /6        // 3072/6=512  

#define SAVE_CYCLE			100 //记录存储周期




///**********************************************************
////外部变量声明   AT24C256
//**********************************************************/
//#define	CARD_SIZE			4 //卡号长度
//#define	NAME_SIZE			CARD_SIZE

//#define AT_PAGE_SIZE	64L  //页大小(字节)
//#define AT_PAGE_SUM		512L //页总数
//#define GROUP_NUM		  31L  //分组数，同步清除所有卡！
//#define GROUP_PAGE		16L  //每组占用页数

//#define	AT_SUM_SIZE			(AT_PAGE_SIZE * AT_PAGE_SUM) //总储存空间大小 32768字节

//#define	GROUP_SPACE			(GROUP_PAGE * AT_PAGE_SIZE) //组空间  16*64=1024
//#define	GROUP_RECORD		(GROUP_SPACE / NAME_SIZE) //组名单数  1024/4=256


/**********************************************************
//0、序列号 （0-127字节）
**********************************************************/
#define	SERIAL_ST			0

								  
/**********************************************************
//1、系统变量（16字节）                                         第1页（128字节）
**********************************************************/
#define	SYSVAR_ST			(AT_PAGE_SIZE*1)

#define	REL_OUTTIME_IDX		SYSVAR_ST    //继电器输出延时0       //已用  单位 秒
#define	ALARMCOUNT_IDX		SYSVAR_ST+1L //报警输出次数1         //已用
#define	CLOCK_DELAY		    SYSVAR_ST+2L //重复刷卡间隔2         //已用  单位 分钟
#define	FOREVER_COUNT_IDX	SYSVAR_ST+3L //长期有效次数3,4,5,6
#define	INSTALL_POS_IDX 	SYSVAR_ST+7L //机器类型              机器数据类型 1字节 （1.扣款  2.计次 3.报餐 4.充值 ）  //已用
#define	INTERVAL_IDX		  SYSVAR_ST+8L //刷卡间隔              //已用      单位 秒  
#define	VOLUME_IDX	      SYSVAR_ST+9L //音量大小 9   最大0-7
#define	CHECK_NAME_IDX		SYSVAR_ST+10L //检查名单10     01检查，00不检查

#define	SYSVAR_SIZE			11 //系统变量占用空间

/***********************
//1.2、扩展参数（16字节）
************************/
#define	EXTVAR_ST			(SYSVAR_ST + 16L)
#define	OUT_CALL_IDX		  EXTVAR_ST+0L //外呼         01 外呼√
#define	CHECK_PW_IDX		  EXTVAR_ST+1L //检查卡密码    01  检查密码 √
#define	LAYER_OUTPUT_IDX	EXTVAR_ST+2L //串口输出楼层控制信息  01 输出 √
#define	FIRE_INPUT_IDX		EXTVAR_ST+3L //消防输入             01 消防输入 √
#define	WHITEYELL         EXTVAR_ST+4L //是否开启检测白名单

#define	EXTVAR_SIZE			5 //系统变量占用空间
/**********************************************************
//1.3、机号（16字节）
**********************************************************/
#define	MACH_ST				(EXTVAR_ST + 16L)
#define	MACH_SIZE			  4              //机号4位


#define	MACH_MEM_SIZE		4            //加密的4位机号

/**********************************************************
//1.4、读写扇区与密码 （16字节）                                
**********************************************************/
#define	SECTION_POS			(MACH_ST + 16L)
#define	PASSWORD_ST			 SECTION_POS+1L 
#define	PASSWORD_SIZE		 6

/**********************************************************
//1.5、编程密码 （16字节）
**********************************************************/
#define	PROGRAMM_POS		(SECTION_POS+16L)
#define	PROGRAMM_SIZE		6

/**********************************************************
//2.1、分组名单数量 （黑名单）                         第2页
**********************************************************/

#define	BACK_NUM_START			(AT_PAGE_SIZE * 2)           //黑名单数量  31*2=62字节
#define BACK_COMM_POS	      (BACK_NUM_START+62L)      //黑名单公共区数量 2字节

/**********************************
//2.2、数据采集起始地址	（8字节	）								    
***********************************/  
#define	NEWDATE_ADDRST	 		(BACK_NUM_START + 64L)

/**********************************************************
//2.3、Flash刷卡记录个数 (8字节)	                                 
**********************************************************/
#define RECORD_POS			    (NEWDATE_ADDRST +8L) //刷卡记录个数	

/**********************************************************
//2.4、Flash实时上传刷卡记录个数 (8字节)	                                 
**********************************************************/
#define UPDATA_RECORD_POS			(RECORD_POS +8L) //刷卡记录个数	

/**********************************************************
//2.5、记录流水号 (8字节)	                                 
**********************************************************/
#define FLOW_NUMBER_POS			 (UPDATA_RECORD_POS +8L) //流水号	   

/**********************************************************
//2.6、实际数卡数量 (8字节)	                                 
**********************************************************/
#define ACTUAL_CARD_POS			 (FLOW_NUMBER_POS +8L) //流水号	  

/**********************************************************
//2.7、操作命令数量 (8字节)	                                 
**********************************************************/
#define OPERATION_COMM_POS	  (ACTUAL_CARD_POS +8L) //流水号	  

/**********************************************************
//2.8、错误数卡数量 (8字节)	                                 
**********************************************************/
#define ERR_CARD_POS			    (OPERATION_COMM_POS +8L) //流水号	

/**********************************************************
//2.9、错误存储数量 (4字节)	                                 
**********************************************************/
#define ERR_RECORDERRCOUNT_POS			    (ERR_CARD_POS +8L) //	




/**********************************************************
//3.1、	TCP模式（自动获取IP，还是固定IP）                                 
**********************************************************/
#define	TCP_STATIC_DHCP_POS       (AT_PAGE_SIZE * 3)

/**********************************************************
//3.2、	本机的Mac地址（6字节）                            
**********************************************************/
#define	TCP_THIS_MAC_POS     (TCP_STATIC_DHCP_POS +16L)

/**********************************************************
//3.3、	本地IP地址、网关、子掩码（16字节）                            
**********************************************************/
#define	TCP_LOCAL_IP_POS     (TCP_THIS_MAC_POS +6L)

/**********************************************************
//3.4、	远端IP地址和端口号    （16字节）                           
**********************************************************/
#define	 TCP_REMOTE_IPandPort_POS     (TCP_LOCAL_IP_POS +32L)

/**********************************************************
//3.5、	4G远端IP地址和端口号    （18字节）                           
**********************************************************/
#define	 TCP4G_REMOTE_IPandPort_POS     (TCP_REMOTE_IPandPort_POS +16L)


/**********************************************************
//4.1、  定值扣费金额    （12字节）                       第4页
**********************************************************/

#define	 FIXED_CONSUMPTION_MONEY     (AT_PAGE_SIZE * 4)              //定值消费金额

/**********************************************************
//4.2、	定值扣费时段    （16字节）                           
**********************************************************/
#define	 FIXED_CONSUMPTION_TIMER    ( FIXED_CONSUMPTION_MONEY+12L )     //定值消费时间段

/**********************************************************
//4.3、	消费总金额    （12字节）                           
**********************************************************/
#define	 CONSUMPTION_ALL_MONEY    ( FIXED_CONSUMPTION_TIMER+16L )     //消费总金额

/**********************************************************
//4.4、	菜单扣费金额    （18字节）                           
**********************************************************/
#define	 CARTE_CONSUMPTION_MONEY    ( CONSUMPTION_ALL_MONEY+12L )     //菜单扣费金额

/**********************************************************
//4.5、	当次消费限额    （8字节）                           
**********************************************************/
#define	 SBU_MAXIMUM_LIMIT    ( CARTE_CONSUMPTION_MONEY+18L )     //当次消费限额 


/**********************************************************
//5、门禁时段                          第5页
**********************************************************/
#define   PERMISSION_PERIOD_POS       (AT_PAGE_SIZE * 5)            //门禁时段   64字节（实际32字节）

#define   PASSAGE_TIME_ENABLE_POS     PERMISSION_PERIOD_POS+64L      //通道时段使能 16字节

#define   PASSAGE_TIME_POS            PASSAGE_TIME_ENABLE_POS+16L    //通道时段  32字节

/**********************************************************
//6、节假日日期                          第6页
**********************************************************/
#define   HOLIDAY_VACATIONS_POS       (AT_PAGE_SIZE * 6)            //节假日日期    40个字节



//开门密码
#define	OPEN_PW_ST			(AT_PAGE_SIZE *7)
#define	OPEN_PW_SIZE		6


/**********************************************************
//8、   WiFi账号密码                                  第7页
**********************************************************/

//#define	PSWD_POS         (SSID_POS + SSID_SIZE)

/**********************************************************
//8、管理卡                                           第8页
**********************************************************/
//#define	ADMIN_POS			(AT_PAGE_SIZE * 8)





/**********************************************************
//黑名单存储  （7936条名单）                                     
**********************************************************/

#define BACK_GROUP_NUM		  31L  //黑名单分组数

#define BACK_GROUP_PAGE		   8L  //黑名单每组占用页数

#define	BACK_GROUP_SPACE	   (BACK_GROUP_PAGE * AT_PAGE_SIZE)   //组空间  8*128=1024

#define	BACK_GROUP_ST			    AT_PAGE_SIZE*10 //黑名单 起始地址= 第10页开始   1280 

#define	BACK_GROUP_END_ST			(BACK_GROUP_ST+BACK_GROUP_SPACE*BACK_GROUP_NUM) //黑名单 结束地址= 黑名单起始地址+组空间*组数量  1280+1024*31=33024

#define	BACK_GROUP_RECORD		   (BACK_GROUP_SPACE/4 )        //组名单数  1024/4=256


/***************************************************
黑名单公共区（512条名单）
*********************************************************/

#define	BACK_COMM_ST				BACK_GROUP_END_ST                //公共区黑名单名单存储起始位置 

#define	BACK_COMM_END_ST 	  BACK_COMM_ST+ BACK_GROUP_SPACE*2  //公共区结束位置(公共区起始地址+公共区名单总地址数量)   274页

#define	BACK_COMM_SIZE		  512L	//((BACK_COMM_END_ST - BACK_COMM_ST) / NAME_SIZE) //黑名单公共区名单数=(公共区结束地址-公共区结束地址) /4        // (65535-63872)/4= 415.75


/**********************************************************
//外部函数声明
**********************************************************/






#endif



/*
AT24C512内存分配情况
第0页--第9页
系统信息

第10页 --257页
名单存储

第258页 --266页（共8页）
公共区名单


*/

















